import 'package:flutter/widgets.dart';

class Article {
  String? url;
  String? title;
  String? content;
  Color? color;
  String? category;

  Article({
    required this.url,
    required this.content,
    required this.color,
    this.category,
    this.title,
  });
}

List<Article> mainSectionArticles = [
  Article(
    url:
        'https://media.istockphoto.com/id/1433432507/photo/healthy-eating-plate-with-vegan-or-vegetarian-food-in-woman-hands-healthy-plant-based-diet.webp?a=1&b=1&s=612x612&w=0&k=20&c=ZpQFw7PDna9cCLKkrVxyGQPqlc1Hy-ZWMoweYf4j8mU=',

    content: """جيد للقلب
يحتوي زيت الأفوكادو على أحماض دهنية غير مشبعة تساعد في تحسين صحة قلبك، يخفض ضغط الدم والكوليسترول السيئ في جسمك، يزيل السموم من الجسم، وبالتالي يحمي الأوعية الدموية.
يعتبر زيت الأفوكادو مصدراً جيداً لمضادات الأكسدة مثل بيتا كاروتين، والليسيثين، وفيتامينات A و D و E، التي تساعد على تغذية البشرة وترطيبها، وتقليل الالتهابات، وتعزيز إنتاج الكولاجين.

يقلل الالتهابات

يحتوي على مركبات تقلل من الالتهابات المزمنة، مثل التهاب المفاصل وآلام العضلات، مما يساعد على تحسين الراحة والحركة.
يساعد زيت الأفوكادو في امتصاص الفيتامينات القابلة للذوبان في الدهون مثل فيتامينات A، D، E، و K، مما يعزز من فعالية النظام الغذائي.يحتوي على اللوتين، وهو مضاد أكسدة مهم لصحة العين، يساعد على الوقاية من التنكس البقعي وإعتام عدسة العين المرتبط بالتقدم في العمر.

يساعد في إنقاص الوزن

الدهون الصحية في زيت الأفوكادو تساعد على الشعور بالشبع لفترة أطول، مما يقلل من تناول السعرات الحرارية ويساعد في التحكم في الوزن يمتلك خصائص مضادة للبكتيريا، مما يساهم في تقليل التهابات اللثة وتحسين رائحة الفم.

مفيد لصحة الشعر

يرطب فروة الرأس، ويعزز من نمو الشعر، ويقلل من التقصف والتساقط بفضل الفيتامينات والدهون الصحية بفضل احتوائه على مضادات الأكسدة والفيتامينات، يساعد زيت الأفوكادو على تقوية مناعة الجسم ومكافحة الأمراض.يساهم في تقليل مقاومة الإنسولين وتحسين استجابة الجسم للسكر، مما يساعد في الوقاية من مرض السكري من النوع الثاني.
""",
    color: Color(0xFfB4cf66),
    category: 'تغذية',
    title: 'أليك عشرة فوائد صحية لزيت الأفوكادو',
  ),
  Article(
    url:
        'https://images.unsplash.com/photo-1485527172732-c00ba1bf8929?q=80&w=2488&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
    content: """مفيد للجهاز الهضمي
 ورغم أن هذه التمارين تلعب دورًا مهمًا في تحسين صحة القلب وحرق السعرات الحرارية، إلا أنها لا تعتبر العامل الوحيد المسؤول عن خسارة الوزن، بل يجب أن تكون جزءًا من خطة شاملة تضم عدة عناصر أخرى. أحد الأسباب الرئيسية لذلك هو أن الجسم يتأقلم بسرعة مع الجهد البدني المتكرر، مما يقلل من كفاءة التمارين الهوائية على المدى الطويل. بالإضافة إلى ذلك، يمكن أن تؤدي تمارين الكارديو المكثفة إلى زيادة الشهية، وهو ما قد يدفع البعض إلى تعويض السعرات الحرارية المحروقة بتناول كميات أكبر من الطعام دون قصد.

الأمر الآخر المهم هو دور تمارين المقاومة أو القوة، مثل رفع الأوزان وتمارين الجسم، في بناء الكتلة العضلية. فكلما زادت الكتلة العضلية في الجسم، زاد معدل حرق السعرات الحرارية حتى أثناء الراحة، وهو ما يُعرف بزيادة معدل الأيض الأساسي. وهذا ما لا توفره تمارين الكارديو وحدها. أما الجانب الأكثر تأثيرًا في فقدان الوزن فهو النظام الغذائي. دون التحكم في السعرات الحرارية وجودة الطعام المتناول، قد لا تظهر نتائج التمارين مهما كانت مكثفة. ففقدان الوزن يحتاج إلى عجز حراري منتظم، يتم تحقيقه غالبًا من خلال تقليل كمية الطعام وتناول أطعمة صحية ومتوازنة.""",
    color: Color(0xFF79bde8),
    category: 'صحة',
    title: ' تمارين الكارديو وحدها لا تكفي لفقدان الوزن',
  ),
  Article(
    url: 'https://ibsacademy.org/U/a/sports-nutrition.jpg',
    content: """ يعزز نضارة البشرة
يحتوي زيت الأفوكادو على أحماض دهنية غير مشبعة تساعد في تحسين صحة قلبك، يخفض ضغط الدم والكوليسترول السيئ في جسمك، يزيل السموم من الجسم، وبالتالي يحمي الأوعية الدموية.
يعتبر زيت الأفوكادو مصدراً جيداً لمضادات الأكسدة مثل بيتا كاروتين، والليسيثين، وفيتامينات A و D و E، التي تساعد على تغذية البشرة وترطيبها، وتقليل الالتهابات، وتعزيز إنتاج الكولاجين.

يقلل الالتهابات

يحتوي على مركبات تقلل من الالتهابات المزمنة، مثل التهاب المفاصل وآلام العضلات، مما يساعد على تحسين الراحة والحركة.
يساعد زيت الأفوكادو في امتصاص الفيتامينات القابلة للذوبان في الدهون مثل فيتامينات A، D، E، و K، مما يعزز من فعالية النظام الغذائي.يحتوي على اللوتين، وهو مضاد أكسدة مهم لصحة العين، يساعد على الوقاية من التنكس البقعي وإعتام عدسة العين المرتبط بالتقدم في العمر.

يساعد في إنقاص الوزن

الدهون الصحية في زيت الأفوكادو تساعد على الشعور بالشبع لفترة أطول، مما يقلل من تناول السعرات الحرارية ويساعد في التحكم في الوزن يمتلك خصائص مضادة للبكتيريا، مما يساهم في تقليل التهابات اللثة وتحسين رائحة الفم.

مفيد لصحة الشعر

يرطب فروة الرأس، ويعزز من نمو الشعر، ويقلل من التقصف والتساقط بفضل الفيتامينات والدهون الصحية بفضل احتوائه على مضادات الأكسدة والفيتامينات، يساعد زيت الأفوكادو على تقوية مناعة الجسم ومكافحة الأمراض.يساهم في تقليل مقاومة الإنسولين وتحسين استجابة الجسم للسكر، مما يساعد في الوقاية من مرض السكري من النوع الثاني.
""",
    color: Color(0xFFf05e8e),
    category: 'جمال',
    title: 'التمارين الرياضية تزيد من الجمال كيف ؟',
  ),
  Article(
    url:
        'https://images.unsplash.com/photo-1483721310020-03333e577078?q=80&w=2428&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
    content: """يُحسّن اللياقة البدنية
يحتوي زيت الأفوكادو على أحماض دهنية غير مشبعة تساعد في تحسين صحة قلبك، يخفض ضغط الدم والكوليسترول السيئ في جسمك، يزيل السموم من الجسم، وبالتالي يحمي الأوعية الدموية.
يعتبر زيت الأفوكادو مصدراً جيداً لمضادات الأكسدة مثل بيتا كاروتين، والليسيثين، وفيتامينات A و D و E، التي تساعد على تغذية البشرة وترطيبها، وتقليل الالتهابات، وتعزيز إنتاج الكولاجين.

يقلل الالتهابات

يحتوي على مركبات تقلل من الالتهابات المزمنة، مثل التهاب المفاصل وآلام العضلات، مما يساعد على تحسين الراحة والحركة.
يساعد زيت الأفوكادو في امتصاص الفيتامينات القابلة للذوبان في الدهون مثل فيتامينات A، D، E، و K، مما يعزز من فعالية النظام الغذائي.يحتوي على اللوتين، وهو مضاد أكسدة مهم لصحة العين، يساعد على الوقاية من التنكس البقعي وإعتام عدسة العين المرتبط بالتقدم في العمر.

يساعد في إنقاص الوزن

الدهون الصحية في زيت الأفوكادو تساعد على الشعور بالشبع لفترة أطول، مما يقلل من تناول السعرات الحرارية ويساعد في التحكم في الوزن يمتلك خصائص مضادة للبكتيريا، مما يساهم في تقليل التهابات اللثة وتحسين رائحة الفم.

مفيد لصحة الشعر

يرطب فروة الرأس، ويعزز من نمو الشعر، ويقلل من التقصف والتساقط بفضل الفيتامينات والدهون الصحية بفضل احتوائه على مضادات الأكسدة والفيتامينات، يساعد زيت الأفوكادو على تقوية مناعة الجسم ومكافحة الأمراض.يساهم في تقليل مقاومة الإنسولين وتحسين استجابة الجسم للسكر، مما يساعد في الوقاية من مرض السكري من النوع الثاني.
""",
    color: Color(0xFFfccd0a),
    category: 'لياقة',
    title: 'اللياقة البدنية وأثارها على الصحة الدائمة',
  ),
];

List<Article> nutrition = [
  Article(
    url: 'https://ibsacademy.org/U/a/sports-nutrition.jpg',
    content:
        "ما الذاكرة العضلية  .. وكيف تريدهاأشهر تمارين الإسترخاء , تساعد على بناء العضلات وتعزيز الراحة النفسية والجسدية يمكنك ممارستها في  المنزل",
    color: Color(0xFfB4cf66),
    category: 'nutrition',
    title: 'تمارين الكارديو وحدها لا تساعد على بناء العضلات',
  ),
  Article(
    url:
        'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQXV2Fz0GPtsuSFi3_pxyL5NpTaZ2kaPKdy_A&s',
    content:
        ' ما الذاكرة العضلية  .. وكيف تريدهاأشهر تمارين الإسترخاء , تساعد على بناء العضلات وتعزيز الراحة النفسية والجسدية يمكنك ممارستها في  المنزل',
    color: Color(0xFfB4cf66),
    category: 'nutrition',
    title: 'تمارين الكارديو وحدها لا تساعد على بناء العضلات',
  ),
];

List<Article> healthy = [
  Article(
    url:
        'https://images.unsplash.com/photo-1485527172732-c00ba1bf8929?q=80&w=2488&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
    content:
        """الطعام الصحي هو الطعام الذي يحتوي على جميع العناصر الغذائية اللازمة لجسم الإنسان، مثل البروتينات، والدهون الصحية، والكربوهيدرات، والفيتامينات، والمعادن. يساعد تناول الطعام الصحي في الحفاظ على وزن صحي، وتقليل خطر الإصابة بالأمراض المزمنة مثل السكري وأمراض القلب.
        الأطعمة الصحية تشمل الفواكه والخضروات، والحبوب الكاملة، والبروتينات الخالية من الدهون مثل الدجاج والأسماك، والدهون الصحية مثل زيت الزيتون والمكسرات. يجب تجنب الأطعمة المعالجة والمشروبات السكرية والوجبات السريعة.
        """,

    color: Color(0xFF79bde8),
    category: 'healthy',
    title: 'الطعام الصحي وأثره على الصحة',
  ),
  Article(
    url:
        'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQXV2Fz0GPtsuSFi3_pxyL5NpTaZ2kaPKdy_A&s',
    content: """
الطعام الصحي هو الطعام الذي يحتوي على جميع العناصر الغذائية اللازمة لجسم الإنسان، مثل البروتينات، والدهون الصحية، والكربوهيدرات، والفيتامينات، والمعادن. يساعد تناول الطعام الصحي في الحفاظ على وزن صحي، وتقليل خطر الإصابة بالأمراض المزمنة مثل السكري وأمراض القلب.
        الأطعمة الصحية تشمل الفواكه والخضروات، والحبوب الكاملة، والبروتينات الخالية من الدهون مثل الدجاج والأسماك، والدهون الصحية مثل زيت الزيتون والمكسرات. يجب تجنب الأطعمة المعالجة والمشروبات السكرية والوجبات السريعة.
        """,
    color: Color(0xFF79bde8),
    category: 'healthy',
    title: 'الطعام الصحي وأثره على الصحة',
  ),
];
List<Article> beauty = [
  Article(
    url:
        'https://plus.unsplash.com/premium_photo-1683121409041-076759249d56?q=80&w=2487&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
    content: """
الجمال والرياضة مرتبطان بشكل وثيق، حيث أن ممارسة الرياضة بانتظام تعزز من صحة الجسم وتساعد في تحسين مظهر البشرة والشعر. إليك بعض الطرق التي تساعد بها الرياضة في تحسين الجمال:
1. تحسين الدورة الدموية: ممارسة الرياضة تعزز من تدفق الدم إلى البشرة، مما يساعد في تحسين مظهرها وجعلها تبدو أكثر إشراقًا.
2. تقليل التوتر: الرياضة تساعد في تقليل مستويات التوتر والقلق، مما ينعكس إيجابيًا على مظهر البشرة ويقلل من ظهور حب الشباب.
3. تعزيز مرونة البشرة: التمارين الرياضية تساعد في تحسين مرونة البشرة وتقليل ظهور التجاعيد.
4. تحسين صحة الشعر: ممارسة الرياضة تعزز من تدفق الدم إلى فروة الرأس، مما يساعد في تعزيز نمو الشعر وتقويته.
5. التخلص من السموم: التعرق أثناء ممارسة الرياضة يساعد في التخلص من السموم والشوائب من البشرة.
""",
    color: Color(0xFFf05e8e),
    category: 'beauty',
    title: 'كيف تساعد الرياضة في تحسين الجمال',
  ),
  Article(
    url:
        'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQXV2Fz0GPtsuSFi3_pxyL5NpTaZ2kaPKdy_A&s',
    content: """
الجمال والرياضة مرتبطان بشكل وثيق، حيث أن ممارسة الرياضة بانتظام تعزز من صحة الجسم وتساعد في تحسين مظهر البشرة والشعر. إليك بعض الطرق التي تساعد بها الرياضة في تحسين الجمال:
1. تحسين الدورة الدموية: ممارسة الرياضة تعزز من تدفق الدم إلى البشرة، مما يساعد في تحسين مظهرها وجعلها تبدو أكثر إشراقًا.
2. تقليل التوتر: الرياضة تساعد في تقليل مستويات التوتر والقلق، مما ينعكس إيجابيًا على مظهر البشرة ويقلل من ظهور حب الشباب.
3. تعزيز مرونة البشرة: التمارين الرياضية تساعد في تحسين مرونة البشرة وتقليل ظهور التجاعيد.
4. تحسين صحة الشعر: ممارسة الرياضة تعزز من تدفق الدم إلى فروة الرأس، مما يساعد في تعزيز نمو الشعر وتقويته.
5. التخلص من السموم: التعرق أثناء ممارسة الرياضة يساعد في التخلص من السموم والشوائب من البشرة.
""",
    color: Color(0xFFf05e8e),
    category: 'beauty',
    title: 'كيف تساعد الرياضة في تحسين الجمال',
  ),
];
List<Article> fitness = [
  Article(
    url: 'https://ibsacademy.org/U/a/sports-nutrition.jpg',
    content: """
ما الذاكرة العضلية  .. وكيف تريدهاأشهر تمارين الإسترخاء , تساعد على بناء العضلات وتعزيز الراحة النفسية والجسدية يمكنك ممارستها في المنزل حيث أن هذه التمارين تلعب دورًا مهمًا في تحسين صحة القلب وحرق السعرات الحرارية، إلا أنها لا تعتبر العامل الوحيد المسؤول عن خسارة الوزن، بل يجب أن تكون جزءًا من خطة شاملة تضم عدة عناصر أخرى. أحد الأسباب الرئيسية لذلك هو أن الجسم يتأقلم بسرعة مع الجهد البدني المتكرر، مما يقلل من كفاءة التمارين الهوائية على المدى الطويل. بالإضافة إلى ذلك، يمكن أن تؤدي تمارين الكارديو المكثفة إلى زيادة الشهية، وهو ما قد يدفع البعض إلى تعويض السعرات الحرارية المحروقة بتناول كميات أكبر من الطعام دون قصد.
الأمر الآخر المهم هو دور تمارين المقاومة أو القوة، مثل رفع الأوزان وتمارين الجسم، في بناء الكتلة العضلية. فكلما زادت الكتلة العضلية في الجسم، زاد معدل حرق السعرات الحرارية حتى أثناء الراحة، وهو ما يُعرف بزيادة معدل الأيض الأساسي. وهذا ما لا توفره تمارين الكارديو وحدها. أما الجانب الأكثر تأثيرًا في فقدان الوزن فهو النظام الغذائي. دون التحكم في السعرات الحرارية وجودة الطعام المتناول، قد لا تظهر نتائج التمارين مهما كانت مكثفة. ففقدان الوزن يحتاج إلى عجز حراري منتظم، يتم تحقيقه غالبًا من خلال تقليل كمية الطعام وتناول أطعمة صحية ومتوازنة. 

""",
    color: Color(0xFFfccd0a),
    category: 'fitness',
    title: 'تمارين الكارديو وحدها لا تساعد على بناء العضلات',
  ),
  Article(
    url:
        'https://images.unsplash.com/photo-1483721310020-03333e577078?q=80&w=2428&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
    content: """
ما الذاكرة العضلية  .. وكيف تريدهاأشهر تمارين الإسترخاء , تساعد على بناء العضلات وتعزيز الراحة النفسية والجسدية يمكنك ممارستها في المنزل حيث أن هذه التمارين تلعب دورًا مهمًا في تحسين صحة القلب وحرق السعرات الحرارية، إلا أنها لا تعتبر العامل الوحيد المسؤول عن خسارة الوزن، بل يجب أن تكون جزءًا من خطة شاملة تضم عدة عناصر أخرى. أحد الأسباب الرئيسية لذلك هو أن الجسم يتأقلم بسرعة مع الجهد البدني المتكرر، مما يقلل من كفاءة التمارين الهوائية على المدى الطويل. بالإضافة إلى ذلك، يمكن أن تؤدي تمارين الكارديو المكثفة إلى زيادة الشهية، وهو ما قد يدفع البعض إلى تعويض السعرات الحرارية المحروقة بتناول كميات أكبر من الطعام دون قصد.
الأمر الآخر المهم هو دور تمارين المقاومة أو القوة، مثل رفع الأوزان وتمارين الجسم، في بناء الكتلة العضلية. فكلما زادت الكتلة العضلية في الجسم، زاد معدل حرق السعرات الحرارية حتى أثناء الراحة، وهو ما يُعرف بزيادة معدل الأيض الأساسي. وهذا ما لا توفره تمارين الكارديو وحدها. أما الجانب الأكثر تأثيرًا في فقدان الوزن فهو النظام الغذائي. دون التحكم في السعرات الحرارية وجودة الطعام المتناول، قد لا تظهر نتائج التمارين مهما كانت مكثفة. ففقدان الوزن يحتاج إلى عجز حراري منتظم، يتم تحقيقه غالبًا من خلال تقليل كمية الطعام وتناول أطعمة صحية ومتوازنة. 

""",
    color: Color(0xFFfccd0a),
    category: 'fitness',
    title: 'تمارين الكارديو وحدها لا تساعد على بناء العضلات',
  ),
];
